// 1) Შექმენით მასივი რომელშიც ჩაწერთ ყველა 3 ის ჯერად რიცხვს 0 დან 100-მდე.
// let arr = [];
// for (let i = 3; i < 100; i++) {
// 	if (i % 3 === 0) {
// 		arr.push(i);
// 	}
// }
// console.log(arr);
// 2) Შექმენით მასივი რომელშიც ჩაწერთ თქვენი მეგობრების სახელებს და
// დაბეჭდეთ console-ში ყველა ის სახელი რომელიც იწყება სიმბოლო a- ზე.
// let names = ['John', 'Alex', 'Mike', 'Sophia', 'Oliver'];
// for (let i = 0; i < names.length; i++) {
// 	if (names[i].charAt(0) === 'a' || names[i].charAt(0) === 'A') {
// 		console.log(names[i]);
// 	}
// }
// 3) Შექმენით მასივი რომელშიც შეინახავთ ყველა 0-დან --- 50-მდე ყველა 2 ის ჯერად
// ან 5 ის ჯერად რიცხვებს მაგრამ არავითარ შემთხვევაში ერთდროულად 2-ის და 5 -
// ის ჯერად რიცხვებს.
// let arr = [];
// for (let i = 0; i < 50; i++) {
// 	if ((i % 2 === 0 || i % 5 === 0) && i % 10 !== 0) {
// 		arr.push(i);
// 	}
// }
// console.log(arr);
// 4) Შექმენით მასივი რომელშიც იქნება შენახული რიცხვები 2, 121, 4341, 242, 562,
// 43, 182, 55, 32, 98, 326 , გადაიარეთ მასივზე ციკლის მეშვეობით და დაბეჭდეთ
// კონსოლ ული რიცხვის გამოყოფების რაოდენობა.
// let numbers = [2, 121, 4341, 242, 562, 43, 182, 55, 32, 98, 326];
// for (let i = 0; i < numbers.length; i++) {
// 	let count = 0;
// 	for (let j = 1; j <= numbers[i] / 2; j++) {
// 		if (numbers[i] % j === 0) {
// 			count++;
// 		}
// 	}
// 	console.log(count + 1);
// }
